[
  {
    "name": "Nataliya Langburd Wright",
    "title": "Assistant Professor",
    "company": "Columbia Business School",
    "quote": "Dennis’s clear communication, empathy, and expertise significantly enhanced my public speaking abilities, ultimately helping me secure a highly coveted position. His teaching approach is empathetic and personalized, ensuring my speaking style was authentic and resonant."
  },
  {
    "name": "Stefan Hanuska",
    "title": "Senior Manager, Deals Transformation",
    "company": "PwC",
    "quote": "Dennis has been instrumental in helping me navigate the complexities of communication within the US market, elevating my confidence and effectiveness. His tailored coaching has had a profoundly positive impact on my professional relationships and led to my recommendation for promotion."
  },
  {
    "name": "Maren Hoff",
    "title": "PhD Candidate",
    "company": "Columbia Business School",
    "quote": "Dennis helped me stay true to myself while refining my public speaking. His guidance allowed me to deliver authentic presentations, which led to receiving flyouts to my dream schools. I couldn’t have done it without his expert coaching."
  },
  {
    "name": "Kunal Sangani",
    "title": "PhD Candidate",
    "company": "Harvard Business School",
    "quote": "Dennis has deep expertise in everything related to public speaking, which is visible in his teaching style through modeling gestures, movement, and tone. He is a remarkable person—empathic, caring, and supportive, offering tailored advice and guidance."
  },
  {
    "name": "Marais Canali Young",
    "title": "Associate Director",
    "company": "Harvard Business School Doctoral Programs",
    "quote": "Dennis’s workshops with our students were incredibly successful, helping them manage performance anxiety and enhance their public speaking skills. His tailored approach to coaching Ph.D. students and helping them refine their elevator pitches was highly effective and transformative."
  },
  {
    "name": "Martin Aragoneses",
    "title": "Assistant Professor",
    "company": "INSEAD",
    "quote": "Dennis’s coaching transformed my approach to public speaking. His practical insights on how to captivate an audience and deliver complex ideas clearly were invaluable. Thanks to his guidance, I now present with confidence, whether in the classroom or at international conferences."
  }
]
